================================================================================
Double quoted string
================================================================================

"text"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string)))

================================================================================
Double quoted escaped string
================================================================================

"new\nline"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string
      (escape_sequence))))

================================================================================
Double quoted invalid escape sequence
================================================================================

"new\Pline"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string
      (escape_sequence
        (escape_sequence_invalid)))))

================================================================================
Single quoted string
================================================================================

'text'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_char))))

================================================================================
Single quoted escaped string
================================================================================

'new\nline'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (escape_sequence)
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_char))))

================================================================================
Single quoted invalid escape sequence
================================================================================

'new\Pline'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (escape_sequence
        (escape_sequence_invalid))
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_char))))

================================================================================
Interpolated string with string
================================================================================

'text {"another string in here"}'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_argument
        (string)))))

================================================================================
Interpolated string with integer
================================================================================

'text {123}'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_argument
        (int_literal)))))

================================================================================
String backticks
================================================================================

`text`

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_backtick)))

================================================================================
Simple single quoted format sequence
================================================================================

'new%sline'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (format_sequence)
      (string_template_char)
      (string_template_char)
      (string_template_char)
      (string_template_char))))

================================================================================
Simple double quoted format sequence
================================================================================

"new%sline"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string
      (format_sequence))))

================================================================================
Format sequence with index
================================================================================

"new%[1]sline"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string
      (format_sequence))))

================================================================================
Invalid format sequence just skipped
================================================================================

"new%Pline"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string)))
