====================
String double quotes
====================

"text"

---

(source_file
  (string))

====================
String single quotes
====================

'text'

---

(source_file
  (string_template))

====================
Interpolated string with string
====================

'text {"another string in here"}'

---

(source_file
  (string_template
    (string_template_argument
      (string))))

====================
Interpolated string with integer
====================

'text {123}'

---

(source_file
  (string_template
    (string_template_argument
      (int_literal))))

================
String backticks
================

`text`

---

(source_file
  (string_backtick))
