================================================================================
Double quoted string
================================================================================

"text"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string)))

================================================================================
Double quoted escaped string
================================================================================

"new\nline"

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string
      (escape_sequence))))

================================================================================
Single quoted string
================================================================================

'text'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_plain))))

================================================================================
Single quoted escaped string
================================================================================

'new\nline'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_plain)
      (escape_sequence)
      (string_template_plain))))

================================================================================
Interpolated string with string
================================================================================

'text {"another string in here"}'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_plain)
      (string_template_argument
        (string)))))

================================================================================
Interpolated string with integer
================================================================================

'text {123}'

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_template
      (string_template_plain)
      (string_template_argument
        (int_literal)))))

================================================================================
String backticks
================================================================================

`text`

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_backtick)))
